soap_request_debug.xml

Content-Type: application/soap+xml; charset=utf-8
SOAPAction: "http://www.portalfiscal.inf.br/nfcom/wsdl/NFComConsulta/nfcomConsulta"

<?xml version="1.0" encoding="UTF-8"?><soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"><soap12:Body><nfcomDadosMsg xmlns="http://www.portalfiscal.inf.br/nfcom/wsdl/NFComConsulta"><consSitNFCom xmlns="http://www.portalfiscal.inf.br/nfcom" versao="1.00"><tpAmb>1</tpAmb><xServ>CONSULTAR</xServ><chNFCom>52260154314807000128620010000000041089076300</chNFCom></consSitNFCom></nfcomDadosMsg></soap12:Body></soap12:Envelope>